{
  "$schema": "https://aka.ms/winget-packages.schema.2.0.json",
  "CreationDate": "2024-01-01T00:00:00.000-00:00",
  "Sources": [
    {
      "Packages": [
        {
          "PackageIdentifier": "Git.Git"
        },
        {
          "PackageIdentifier": "GitHub.cli"
        },
        {
          "PackageIdentifier": "jqlang.jq"
        },
        {
          "PackageIdentifier": "Docker.DockerDesktop"
        },
        {
          "PackageIdentifier": "GnuPG.GnuPG"
        },
        {
          "PackageIdentifier": "Bitwarden.CLI"
        },
        {
          "PackageIdentifier": "Bitwarden.Bitwarden"
        },
        {
          "PackageIdentifier": "OpenSSH.OpenSSH"
        },
        {
          "PackageIdentifier": "Microsoft.WindowsTerminal"
        },
        {
          "PackageIdentifier": "Microsoft.VisualStudioCode"
        },
        {
          "PackageIdentifier": "Microsoft.PowerToys"
        },
        {
          "PackageIdentifier": "JetBrains.JetBrainsMono.NF"
        },
        {
          "PackageIdentifier": "Anthropic.Claude"
        },
        {
          "PackageIdentifier": "Axosoft.GitKraken"
        },
        {
          "PackageIdentifier": "LinearOrbit.Linear"
        },
        {
          "PackageIdentifier": "Mozilla.Firefox"
        },
        {
          "PackageIdentifier": "dotPDN.PaintDotNet"
        },
        {
          "PackageIdentifier": "Microsoft.Sysinternals.Suite"
        },
        {
          "PackageIdentifier": "Skillbrains.Lightshot"
        }
      ],
      "SourceDetails": {
        "Argument": "https://cdn.winget.microsoft.com/cache",
        "Identifier": "Microsoft.Winget.Source_8wekyb3d8bbwe",
        "Name": "winget",
        "Type": "Microsoft.PreIndexed.Package"
      }
    }
  ],
  "WinGetVersion": "1.6.2771"
}